; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_3 ?v1 ?v9)
             (pred_10 ?v7 ?v4)
             (pred_11 ?v1 ?v4)
             (pred_9 ?v12 ?v1 )
	     (pred_5 ?v1)
             (pred_12 ?v5)
             (pred_7 ?v7)
             (pred_1 ?v4)
             (pred_8 ?v1)
             (pred_6 ?v7)
             (pred_4 ?v1)
             (pred_2 ))



(:action op_2
:parameters (?v8 ?v11 ?v2 ?v13)
:precondition (and (pred_12 ?v8) (pred_12 ?v11) (pred_7 ?v2) (pred_1 ?v13)
          (pred_3 ?v8 ?v11) (pred_10 ?v2 ?v13)
                   (pred_11 ?v11 ?v13) (pred_5 ?v8) 
                   (pred_8 ?v11) (pred_6 ?v2))
:effect (and  (pred_4 ?v11) (not (pred_8 ?v11))))


(:action op_5
:parameters (?v8 ?v3)
:precondition (and (pred_12 ?v8) (pred_12 ?v3)
               (pred_5 ?v8) (pred_3 ?v8 ?v3) (pred_4 ?v3))
:effect (and (pred_5 ?v3) (not (pred_5 ?v8))))

(:action op_3
:parameters (?v8 ?v2)
:precondition (and (pred_12 ?v8) (pred_7 ?v2) 
                  (pred_5 ?v8) (pred_9 ?v2 ?v8) (pred_2 ))
:effect (and (pred_6 ?v2)
   (not (pred_9 ?v2 ?v8)) (not (pred_2 ))))


(:action op_1
:parameters (?v8 ?v10 ?v6)
:precondition (and (pred_12 ?v8) (pred_7 ?v10) (pred_7 ?v6)
                  (pred_5 ?v8) (pred_6 ?v6) (pred_9 ?v10 ?v8))
:effect (and (pred_6 ?v10) (pred_9 ?v6 ?v8)
        (not (pred_6 ?v6)) (not (pred_9 ?v10 ?v8))))

(:action op_4
:parameters (?v8 ?v2)
:precondition (and (pred_12 ?v8) (pred_7 ?v2) 
                  (pred_5 ?v8) (pred_6 ?v2))
:effect (and (pred_2 ) (pred_9 ?v2 ?v8) (not (pred_6 ?v2)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_24 obj_18 obj_20 obj_08 obj_07 obj_21 obj_16 obj_25 obj_15 obj_13 obj_14 obj_12 obj_11 obj_01 obj_29 obj_02 obj_05 obj_03 obj_17 obj_30 obj_10 obj_09 obj_31 obj_26 obj_28
    obj_19 obj_04 obj_27
    obj_22 obj_06 obj_23
    )

    (:init
       (pred_2)

       (pred_12 obj_24)
       (pred_12 obj_18)
       (pred_12 obj_20)
       (pred_12 obj_08)
       (pred_12 obj_07)
       (pred_12 obj_21)
       (pred_12 obj_16)
       (pred_12 obj_25)
       (pred_12 obj_15)
       (pred_12 obj_13)
       (pred_12 obj_14)
       (pred_12 obj_12)
       (pred_12 obj_11)
       (pred_12 obj_01)
       (pred_12 obj_29)
       (pred_12 obj_02)
       (pred_12 obj_05)
       (pred_12 obj_03)
       (pred_12 obj_17)
       (pred_12 obj_30)
       (pred_12 obj_10)
       (pred_12 obj_09)
       (pred_12 obj_31)
       (pred_12 obj_26)
       (pred_12 obj_28)
       (pred_1 obj_19)
       (pred_1 obj_04)
       (pred_1 obj_27)
       (pred_7 obj_22)
       (pred_7 obj_06)
       (pred_7 obj_23)

       (pred_3 obj_24 obj_21)
       (pred_3 obj_24 obj_18)
       (pred_3 obj_18 obj_16)
       (pred_3 obj_18 obj_20)
       (pred_3 obj_18 obj_24)
       (pred_3 obj_20 obj_25)
       (pred_3 obj_20 obj_08)
       (pred_3 obj_20 obj_18)
       (pred_3 obj_08 obj_15)
       (pred_3 obj_08 obj_07)
       (pred_3 obj_08 obj_20)
       (pred_3 obj_07 obj_13)
       (pred_3 obj_07 obj_08)
       (pred_3 obj_21 obj_14)
       (pred_3 obj_21 obj_16)
       (pred_3 obj_21 obj_24)
       (pred_3 obj_16 obj_12)
       (pred_3 obj_16 obj_25)
       (pred_3 obj_16 obj_18)
       (pred_3 obj_16 obj_21)
       (pred_3 obj_25 obj_11)
       (pred_3 obj_25 obj_15)
       (pred_3 obj_25 obj_20)
       (pred_3 obj_25 obj_16)
       (pred_3 obj_15 obj_01)
       (pred_3 obj_15 obj_13)
       (pred_3 obj_15 obj_08)
       (pred_3 obj_15 obj_25)
       (pred_3 obj_13 obj_29)
       (pred_3 obj_13 obj_07)
       (pred_3 obj_13 obj_15)
       (pred_3 obj_14 obj_02)
       (pred_3 obj_14 obj_12)
       (pred_3 obj_14 obj_21)
       (pred_3 obj_12 obj_05)
       (pred_3 obj_12 obj_11)
       (pred_3 obj_12 obj_16)
       (pred_3 obj_12 obj_14)
       (pred_3 obj_11 obj_03)
       (pred_3 obj_11 obj_01)
       (pred_3 obj_11 obj_25)
       (pred_3 obj_11 obj_12)
       (pred_3 obj_01 obj_17)
       (pred_3 obj_01 obj_29)
       (pred_3 obj_01 obj_15)
       (pred_3 obj_01 obj_11)
       (pred_3 obj_29 obj_30)
       (pred_3 obj_29 obj_13)
       (pred_3 obj_29 obj_01)
       (pred_3 obj_02 obj_10)
       (pred_3 obj_02 obj_05)
       (pred_3 obj_02 obj_14)
       (pred_3 obj_05 obj_09)
       (pred_3 obj_05 obj_03)
       (pred_3 obj_05 obj_12)
       (pred_3 obj_05 obj_02)
       (pred_3 obj_03 obj_31)
       (pred_3 obj_03 obj_17)
       (pred_3 obj_03 obj_11)
       (pred_3 obj_03 obj_05)
       (pred_3 obj_17 obj_26)
       (pred_3 obj_17 obj_30)
       (pred_3 obj_17 obj_01)
       (pred_3 obj_17 obj_03)
       (pred_3 obj_30 obj_28)
       (pred_3 obj_30 obj_29)
       (pred_3 obj_30 obj_17)
       (pred_3 obj_10 obj_09)
       (pred_3 obj_10 obj_02)
       (pred_3 obj_09 obj_31)
       (pred_3 obj_09 obj_05)
       (pred_3 obj_09 obj_10)
       (pred_3 obj_31 obj_26)
       (pred_3 obj_31 obj_03)
       (pred_3 obj_31 obj_09)
       (pred_3 obj_26 obj_28)
       (pred_3 obj_26 obj_17)
       (pred_3 obj_26 obj_31)
       (pred_3 obj_28 obj_30)
       (pred_3 obj_28 obj_26)
       (pred_8 obj_17)
       (pred_8 obj_08)
       (pred_8 obj_01)
       (pred_11  obj_17 obj_19)
       (pred_11  obj_08 obj_04)
       (pred_11  obj_01 obj_27)
       (pred_4 obj_24)
       (pred_4 obj_18)
       (pred_4 obj_20)
       (pred_4 obj_07)
       (pred_4 obj_21)
       (pred_4 obj_16)
       (pred_4 obj_25)
       (pred_4 obj_15)
       (pred_4 obj_13)
       (pred_4 obj_14)
       (pred_4 obj_12)
       (pred_4 obj_11)
       (pred_4 obj_29)
       (pred_4 obj_02)
       (pred_4 obj_05)
       (pred_4 obj_03)
       (pred_4 obj_30)
       (pred_4 obj_10)
       (pred_4 obj_09)
       (pred_4 obj_31)
       (pred_4 obj_26)
       (pred_4 obj_28)

       (pred_10  obj_22 obj_19)
       (pred_10  obj_06 obj_04)
       (pred_10  obj_23 obj_27)
       (pred_9 obj_22 obj_11)
       (pred_9 obj_06 obj_31)
       (pred_9 obj_23 obj_14)
       (pred_5 obj_24)
    )

    (:goal (and
       (pred_9 obj_06 obj_21)
    ))
(:constraints
  (always (not (pred_5 obj_03)))
)
)

; plan
1. (op_5 obj_24 obj_18)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_18)
   goals met: 0 of 1
2. (op_5 obj_18 obj_16)
   deleted: (pred_5 obj_18)
   added: (pred_5 obj_16)
   goals met: 0 of 1
3. (op_5 obj_16 obj_12)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_12)
   goals met: 0 of 1
4. (op_5 obj_12 obj_05)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_05)
   goals met: 0 of 1
5. (op_5 obj_05 obj_09)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_09)
   goals met: 0 of 1
6. (op_5 obj_09 obj_31)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_31)
   goals met: 0 of 1
7. (op_3 obj_31 obj_06)
   deleted: (pred_9 obj_06 obj_31) (pred_2)
   added: (pred_6 obj_06)
   goals met: 0 of 1
8. (op_5 obj_31 obj_09)
   deleted: (pred_5 obj_31)
   added: (pred_5 obj_09)
   goals met: 0 of 1
9. (op_5 obj_09 obj_05)
   deleted: (pred_5 obj_09)
   added: (pred_5 obj_05)
   goals met: 0 of 1
10. (op_5 obj_05 obj_12)
   deleted: (pred_5 obj_05)
   added: (pred_5 obj_12)
   goals met: 0 of 1
11. (op_5 obj_12 obj_16)
   deleted: (pred_5 obj_12)
   added: (pred_5 obj_16)
   goals met: 0 of 1
12. (op_5 obj_16 obj_21)
   deleted: (pred_5 obj_16)
   added: (pred_5 obj_21)
   goals met: 0 of 1
13. (op_4 obj_21 obj_06)
   deleted: (pred_6 obj_06)
   added: (pred_2) (pred_9 obj_06 obj_21)
   goals met: 1 of 1
